In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('hapiness_report_2022.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  146 non-null    object
 1   score    146 non-null    float64
 2   income   140 non-null    object
dtypes: float64(1), object(2)
memory usage: 3.6+ KB

In [6]:
df.head(1)

   country  score       income
0  Finland  7.821  High income

In [7]:
df[df['income'].isna()]

            country  score income
25           Taiwan  6.512    NaN
78     North Cyprus  5.467    NaN
87      Ivory Coast  5.235    NaN
98   Congo Kinshasa  5.075    NaN
107       Venezuela  4.925    NaN
121       Palestine  4.483    NaN

In [8]:
df[df['country']=='Nigeria']

     country  score               income
117  Nigeria  4.552  Lower middle income

In [9]:
df['score'].max()

7.821

In [11]:
df[df['score']==7.821]

   country  score       income
0  Finland  7.821  High income

In [12]:
df.dropna()

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[140 rows x 3 columns]